---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.GetFlangeThicknessInFlangeCenter
source: html/9552a798-9366-8d76-52ca-fd677ed173c4.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.GetFlangeThicknessInFlangeCenter Method

Returns thickness of flange measured in the 0.5 * (width - webThickess),
 sometimes used for sections with width > 300 mm.

## Syntax (C#)
```csharp
public double GetFlangeThicknessInFlangeCenter()
```